[
  {
    "id": 0,
    "readOnly": true,
    "description": "I had a terrible headache that wouldn’t go away all day. Even resting didn’t help much, and I barely got anything done.",
    "score": 2,
    "date": "2024/11/19"
  },
  {
    "id": 1,
    "readOnly": true,
    "description": "Went for a walk in the park and listened to my favorite podcast. The fresh air and quiet helped me clear my head.",
    "score": 7,
    "date": "2024/11/20"
  },
  {
    "id": 2,
    "readOnly": true,
    "description": "Had an amazing brainstorming session at work. I felt creative and appreciated by my team.",
    "score": 9,
    "date": "2024/11/21"
  },
  {
    "id": 3,
    "readOnly": true,
    "description": "Lost track of time and missed an important appointment. Felt stressed and disappointed in myself for the rest of the day.",
    "score": 3,
    "date": "2024/11/22"
  },
  {
    "id": 4,
    "readOnly": true,
    "description": "Spent the evening watching a new show and trying a new recipe. Nothing exciting happened, but it was a pleasant day.",
    "score": 5,
    "date": "2024/11/23"
  },
  {
    "id": 5,
    "readOnly": true,
    "description": "A friend surprised me with a thoughtful message. It really lifted my spirits and made me feel appreciated.",
    "score": 8,
    "date": "2024/11/24"
  },
  {
    "id": 6,
    "readOnly": true,
    "description": "Barely slept last night and dragged through the entire day. Felt unfocused and irritable.",
    "score": 1,
    "date": "2024/11/25"
  },
  {
    "id": 7,
    "readOnly": true,
    "description": "Had a coffee with an old friend I hadn’t seen in years. We talked for hours and it made me feel really good.",
    "score": 10,
    "date": "2024/11/26"
  },
  {
    "id": 8,
    "readOnly": true,
    "description": "Accidentally spilled coffee on my laptop. Spent the rest of the day trying to fix things and feeling frustrated.",
    "score": 4,
    "date": "2024/11/27"
  },
  {
    "id": 9,
    "readOnly": true,
    "description": "Went to the gym after weeks of skipping. It was tough, but I left feeling energized and proud of myself.",
    "score": 6,
    "date": "2024/11/28"
  },
  {
    "id": 10,
    "readOnly": true,
    "description": "Felt overwhelmed at work with all the deadlines piling up. I barely managed to keep my focus and felt exhausted.",
    "score": 3,
    "date": "2024/11/29"
  },
  {
    "id": 11,
    "readOnly": true,
    "description": "Got complimented on my presentation by the manager. It boosted my confidence for the rest of the day.",
    "score": 8,
    "date": "2024/11/30"
  },
  {
    "id": 12,
    "readOnly": true,
    "description": "Nothing really exciting happened. I worked, ate, and went to bed early.",
    "score": 5,
    "date": "2024/12/01"
  },
  {
    "id": 13,
    "readOnly": true,
    "description": "Received some sad news about a relative's health. It put a heavy weight on my chest all day.",
    "score": 2,
    "date": "2024/12/02"
  },
  {
    "id": 14,
    "readOnly": true,
    "description": "Had a spontaneous dinner with friends I hadn’t seen in ages. We laughed a lot and shared stories all night.",
    "score": 9,
    "date": "2024/12/03"
  },
  {
    "id": 15,
    "readOnly": true,
    "description": "My internet was down most of the day. It was frustrating and made me fall behind on work.",
    "score": 4,
    "date": "2024/12/04"
  },
  {
    "id": 16,
    "readOnly": true,
    "description": "Tried meditating for the first time. I felt calmer and more centered afterward.",
    "score": 7,
    "date": "2024/12/05"
  },
  {
    "id": 17,
    "readOnly": true,
    "description": "Woke up to a beautiful snowfall. Took a peaceful walk and enjoyed the quiet around me.",
    "score": 8,
    "date": "2024/12/06"
  },
  {
    "id": 18,
    "readOnly": true,
    "description": "Overslept and missed an important meeting. Felt embarrassed and had to reschedule.",
    "score": 3,
    "date": "2024/12/07"
  },
  {
    "id": 19,
    "readOnly": true,
    "description": "Got a chance to volunteer at a local shelter. It was tiring but fulfilling and reminded me to be grateful.",
    "score": 9,
    "date": "2024/12/08"
  },
  {
    "id": 20,
    "readOnly": true,
    "description": "Felt very sick and stayed in bed all day. It was miserable and I didn’t even have the energy to read or watch anything.",
    "score": 1,
    "date": "2024/12/09"
  },
  {
    "id": 21,
    "readOnly": true,
    "description": "Made good progress on a personal project. It felt great to finally see things moving forward.",
    "score": 7,
    "date": "2024/12/10"
  },
  {
    "id": 22,
    "readOnly": true,
    "description": "Felt a bit down for no particular reason. Nothing seemed to excite me or cheer me up.",
    "score": 4,
    "date": "2024/12/11"
  },
  {
    "id": 23,
    "readOnly": true,
    "description": "Went out for coffee and ran into an old friend. We ended up chatting for over an hour and made plans to catch up again.",
    "score": 8,
    "date": "2024/12/12"
  },
  {
    "id": 24,
    "readOnly": true,
    "description": "Had an argument with someone close to me. It left me feeling drained and a bit sad for the rest of the day.",
    "score": 2,
    "date": "2024/12/13"
  },
  {
    "id": 25,
    "readOnly": true,
    "description": "Finished reading a really good book. I got so absorbed in the story that I barely noticed the time passing.",
    "score": 7,
    "date": "2024/12/14"
  },
  {
    "id": 26,
    "readOnly": true,
    "description": "Got caught in the rain without an umbrella. I was soaked and cold, and it ruined my mood.",
    "score": 3,
    "date": "2024/12/15"
  },
  {
    "id": 27,
    "readOnly": true,
    "description": "Tried a new restaurant and absolutely loved the food. The ambiance was relaxing and cozy.",
    "score": 9,
    "date": "2024/12/16"
  },
  {
    "id": 28,
    "readOnly": true,
    "description": "Didn't get much done at all today. I procrastinated a lot and felt guilty by the end of the day.",
    "score": 4,
    "date": "2024/12/17"
  },
  {
    "id": 29,
    "readOnly": true,
    "description": "Got tickets to a show I really wanted to see. It completely made my day and gave me something to look forward to.",
    "score": 10,
    "date": "2024/12/18"
  },
  {
    "id": 30,
    "readOnly": true,
    "description": "Burnt my breakfast and had to skip my morning meal. The rest of the day felt a bit off because of it.",
    "score": 3,
    "date": "2024/12/19"
  },
  {
    "id": 31,
    "readOnly": true,
    "description": "Watched a hilarious show that made me laugh out loud. It really helped lighten my mood.",
    "score": 7,
    "date": "2024/12/20"
  },
  {
    "id": 32,
    "readOnly": true,
    "description": "Got stuck in traffic for over an hour. Arrived late to an appointment and felt frustrated all evening.",
    "score": 2,
    "date": "2024/12/21"
  },
  {
    "id": 33,
    "readOnly": true,
    "description": "Had an amazing day exploring a nearby town. Took lots of pictures and enjoyed some delicious food.",
    "score": 9,
    "date": "2024/12/22"
  },
  {
    "id": 34,
    "readOnly": true,
    "description": "Was feeling low energy and couldn’t concentrate. Ended up wasting most of the day.",
    "score": 4,
    "date": "2024/12/23"
  },
  {
    "id": 35,
    "readOnly": true,
    "description": "Went ice skating for the first time in years. It was fun and nostalgic, even though I fell once.",
    "score": 8,
    "date": "2024/12/24"
  },
  {
    "id": 36,
    "readOnly": true,
    "description": "Spent a quiet Christmas Eve with family. Shared stories, played games, and felt grateful for the time together.",
    "score": 9,
    "date": "2024/12/25"
  },
  {
    "id": 37,
    "readOnly": true,
    "description": "Got a lovely gift that made me feel truly appreciated. It was a peaceful and heartwarming day.",
    "score": 10,
    "date": "2024/12/26"
  },
  {
    "id": 38,
    "readOnly": true,
    "description": "Had a lazy day watching old movies and snacking. Didn’t do much but it felt good to rest.",
    "score": 6,
    "date": "2024/12/27"
  },
  {
    "id": 39,
    "readOnly": true,
    "description": "Felt anxious without a clear reason. Tried journaling but couldn’t shake the unease.",
    "score": 3,
    "date": "2024/12/28"
  },
  {
    "id": 40,
    "readOnly": true,
    "description": "Cleaned up the whole apartment and rearranged the furniture. It felt refreshing and productive.",
    "score": 7,
    "date": "2024/12/29"
  },
  {
    "id": 41,
    "readOnly": true,
    "description": "Had a heartfelt conversation with a close friend. We opened up about things we usually avoid.",
    "score": 8,
    "date": "2024/12/30"
  },
  {
    "id": 42,
    "readOnly": true,
    "description": "Celebrated New Year’s Eve at home. It was low-key, but full of good vibes and reflection.",
    "score": 7,
    "date": "2024/12/31"
  },
  {
    "id": 43,
    "readOnly": true,
    "description": "Woke up feeling hopeful and energized. Started the year with a nice walk and some goal-setting.",
    "score": 9,
    "date": "2025/01/01"
  },
  {
    "id": 44,
    "readOnly": true,
    "description": "Did absolutely nothing all day. Felt a little bored, but also enjoyed the calm.",
    "score": 5,
    "date": "2025/01/02"
  },
  {
    "id": 45,
    "readOnly": true,
    "description": "Had a minor argument with a coworker. It threw me off for the rest of the day.",
    "score": 4,
    "date": "2025/01/03"
  },
  {
    "id": 46,
    "readOnly": true,
    "description": "Went to the gym and had an intense workout. Felt strong and proud afterward.",
    "score": 8,
    "date": "2025/01/04"
  },
  {
    "id": 47,
    "readOnly": true,
    "description": "Spilled coffee on my laptop. Managed to save it, but it was a stressful experience.",
    "score": 2,
    "date": "2025/01/05"
  },
  {
    "id": 48,
    "readOnly": true,
    "description": "Started reading a new novel and got completely hooked. Spent hours lost in the story.",
    "score": 7,
    "date": "2025/01/06"
  },
  {
    "id": 49,
    "readOnly": true,
    "description": "Had a surprise video call from a friend abroad. It was a great catch-up and lifted my spirits.",
    "score": 9,
    "date": "2025/01/07"
  },
  {
    "id": 50,
    "readOnly": true,
    "description": "Woke up with a headache and couldn’t focus all morning. Took a nap and felt slightly better later.",
    "score": 3,
    "date": "2025/01/08"
  },
  {
    "id": 51,
    "readOnly": true,
    "description": "Had lunch with an old friend and shared a lot of laughs. It felt really good to reconnect.",
    "score": 8,
    "date": "2025/01/09"
  },
  {
    "id": 52,
    "readOnly": true,
    "description": "Lost my umbrella during a sudden rainstorm. Got completely soaked and cold on the way home.",
    "score": 2,
    "date": "2025/01/10"
  },
  {
    "id": 53,
    "readOnly": true,
    "description": "Got a surprise gift at work for helping out a colleague. It really brightened my day.",
    "score": 9,
    "date": "2025/01/11"
  },
  {
    "id": 54,
    "readOnly": true,
    "description": "Spent the afternoon painting and listening to music. It was relaxing and satisfying.",
    "score": 7,
    "date": "2025/01/12"
  },
  {
    "id": 55,
    "readOnly": true,
    "description": "Slept poorly and felt cranky all day. Everything seemed harder than usual.",
    "score": 3,
    "date": "2025/01/13"
  },
  {
    "id": 56,
    "readOnly": true,
    "description": "Attended a live comedy show. Laughed until my cheeks hurt and left in a great mood.",
    "score": 10,
    "date": "2025/01/14"
  },
  {
    "id": 57,
    "readOnly": true,
    "description": "Tried cooking a new recipe but burned half of it. Still had fun experimenting in the kitchen.",
    "score": 5,
    "date": "2025/01/15"
  },
  {
    "id": 58,
    "readOnly": true,
    "description": "Took a long walk through the park. The fresh air and quiet helped clear my mind.",
    "score": 7,
    "date": "2025/01/16"
  },
  {
    "id": 59,
    "readOnly": true,
    "description": "My phone crashed and I lost a bunch of important notes. It was a really frustrating day.",
    "score": 2,
    "date": "2025/01/17"
  },
  {
    "id": 60,
    "readOnly": true,
    "description": "Got an unexpected compliment that made me smile. It boosted my confidence all day.",
    "score": 8,
    "date": "2025/01/18"
  },
  {
    "id": 61,
    "readOnly": true,
    "description": "Felt anxious and distracted at work. Couldn’t finish everything I planned.",
    "score": 4,
    "date": "2025/01/19"
  },
  {
    "id": 62,
    "readOnly": true,
    "description": "Finally completed a personal project I’d been putting off. Felt very accomplished.",
    "score": 9,
    "date": "2025/01/20"
  },
  {
    "id": 63,
    "readOnly": true,
    "description": "Had to wait at the doctor’s office for hours. The whole experience was draining.",
    "score": 3,
    "date": "2025/01/21"
  },
  {
    "id": 64,
    "readOnly": true,
    "description": "Found a cozy new café and spent the afternoon reading. The atmosphere was perfect.",
    "score": 8,
    "date": "2025/01/22"
  },
  {
    "id": 65,
    "readOnly": true,
    "description": "Twisted my ankle while jogging. Had to rest the whole day with an ice pack.",
    "score": 2,
    "date": "2025/01/23"
  },
  {
    "id": 66,
    "readOnly": true,
    "description": "Watched the sunrise from the rooftop with a warm drink. It was peaceful and inspiring.",
    "score": 9,
    "date": "2025/01/24"
  },
  {
    "id": 67,
    "readOnly": true,
    "description": "Got overwhelmed by tasks and didn’t know where to start. Ended up procrastinating.",
    "score": 4,
    "date": "2025/01/25"
  },
  {
    "id": 68,
    "readOnly": true,
    "description": "Visited a museum and learned about local history. It was engaging and surprisingly fun.",
    "score": 7,
    "date": "2025/01/26"
  },
  {
    "id": 69,
    "readOnly": true,
    "description": "Had dinner with family and shared some heartfelt moments. Felt deeply connected and happy.",
    "score": 10,
    "date": "2025/01/27"
  },
  {
    "id": 70,
    "readOnly": true,
    "description": "Missed an important meeting because I forgot to set an alarm. Felt embarrassed and unprofessional.",
    "score": 2,
    "date": "2025/01/28"
  },
  {
    "id": 71,
    "readOnly": true,
    "description": "Went for a spontaneous road trip. Discovered a charming town and had the best coffee ever.",
    "score": 9,
    "date": "2025/01/29"
  },
  {
    "id": 72,
    "readOnly": true,
    "description": "Felt completely unmotivated today. I couldn't get anything done and just watched TV all day.",
    "score": 3,
    "date": "2025/01/30"
  },
  {
    "id": 73,
    "readOnly": true,
    "description": "Ran into someone from college and had a great catch-up chat. It brought back good memories.",
    "score": 7,
    "date": "2025/01/31"
  },
  {
    "id": 74,
    "readOnly": true,
    "description": "Everything went wrong today. Burned breakfast, missed the bus, and got caught in the rain.",
    "score": 1,
    "date": "2025/02/01"
  },
  {
    "id": 75,
    "readOnly": true,
    "description": "Treated myself to a massage and a nice meal. Felt relaxed and refreshed by the end of the day.",
    "score": 8,
    "date": "2025/02/02"
  },
  {
    "id": 76,
    "readOnly": true,
    "description": "Had a long conversation with someone I care about. We talked openly and connected deeply.",
    "score": 10,
    "date": "2025/02/03"
  },
  {
    "id": 77,
    "readOnly": true,
    "description": "Lost track of time and ended up staying up too late. Now I'm feeling groggy and irritated.",
    "score": 4,
    "date": "2025/02/04"
  },
  {
    "id": 78,
    "readOnly": true,
    "description": "Discovered a new song that I love and listened to it on repeat. It totally lifted my mood.",
    "score": 7,
    "date": "2025/02/05"
  },
  {
    "id": 79,
    "readOnly": true,
    "description": "Had to deal with some unexpected expenses. It added a lot of stress to my day.",
    "score": 3,
    "date": "2025/02/06"
  },
  {
    "id": 80,
    "readOnly": true,
    "description": "Finished a big task ahead of schedule. Felt proud of my focus and efficiency today.",
    "score": 9,
    "date": "2025/02/07"
  },
  {
    "id": 81,
    "readOnly": true,
    "description": "Accidentally spilled water on my laptop. It still works, but I’m nervous it might break.",
    "score": 2,
    "date": "2025/02/08"
  },
  {
    "id": 82,
    "readOnly": true,
    "description": "Had a cozy night watching old movies with snacks. It was simple but really comforting.",
    "score": 8,
    "date": "2025/02/09"
  },
  {
    "id": 83,
    "readOnly": true,
    "description": "Felt like no one was listening to me today. It left me feeling a bit invisible and sad.",
    "score": 3,
    "date": "2025/02/10"
  },
  {
    "id": 84,
    "readOnly": true,
    "description": "Went to the gym and pushed myself harder than usual. Felt strong and accomplished afterward.",
    "score": 9,
    "date": "2025/02/11"
  },
  {
    "id": 85,
    "readOnly": true,
    "description": "Received disappointing news from work. It really took the wind out of my sails.",
    "score": 2,
    "date": "2025/02/12"
  },
  {
    "id": 86,
    "readOnly": true,
    "description": "Made homemade pizza from scratch. It was delicious and fun to prepare.",
    "score": 7,
    "date": "2025/02/13"
  },
  {
    "id": 87,
    "readOnly": true,
    "description": "Spent the whole day running errands. It was productive, but I'm completely exhausted.",
    "score": 5,
    "date": "2025/02/14"
  },
  {
    "id": 88,
    "readOnly": true,
    "description": "Surprised someone with a small gift and their reaction made my whole day.",
    "score": 8,
    "date": "2025/02/15"
  },
  {
    "id": 89,
    "readOnly": true,
    "description": "Was stuck in meetings all day and barely got to do anything I actually needed to do.",
    "score": 4,
    "date": "2025/02/16"
  },
  {
    "id": 90,
    "readOnly": true,
    "description": "Had a lazy day at home and couldn’t shake off the feeling of boredom. Nothing really happened.",
    "score": 4,
    "date": "2025/02/21"
  },
  {
    "id": 91,
    "readOnly": true,
    "description": "Received a thoughtful message from an old friend. It totally brightened my day.",
    "score": 9,
    "date": "2025/02/26"
  },
  {
    "id": 92,
    "readOnly": true,
    "description": "Woke up feeling sick and had to cancel all my plans. Stayed in bed most of the day.",
    "score": 2,
    "date": "2025/03/02"
  },
  {
    "id": 93,
    "readOnly": true,
    "description": "Went hiking in nature. The weather was perfect, and I felt truly at peace.",
    "score": 10,
    "date": "2025/03/07"
  },
  {
    "id": 94,
    "readOnly": true,
    "description": "Overslept and missed my first appointment. Felt rushed and scattered all day.",
    "score": 3,
    "date": "2025/03/12"
  },
  {
    "id": 95,
    "readOnly": true,
    "description": "Tried a new recipe and it turned out amazing. Everyone loved it!",
    "score": 8,
    "date": "2025/03/17"
  },
  {
    "id": 96,
    "readOnly": true,
    "description": "Had a terrible headache that wouldn’t go away. I couldn’t focus on anything.",
    "score": 1,
    "date": "2025/03/22"
  },
  {
    "id": 97,
    "readOnly": true,
    "description": "Visited a museum I’ve never been to. It was surprisingly interesting and refreshing.",
    "score": 7,
    "date": "2025/03/27"
  },
  {
    "id": 98,
    "readOnly": true,
    "description": "Got into a small argument with someone close. We resolved it, but it left me drained.",
    "score": 4,
    "date": "2025/04/01"
  },
  {
    "id": 99,
    "readOnly": true,
    "description": "Took a break from screens and spent time reading in the sun. It felt healing.",
    "score": 9,
    "date": "2025/04/06"
  },
  {
    "id": 100,
    "readOnly": true,
    "description": "Everything felt like too much today. I was overwhelmed by even small tasks.",
    "score": 2,
    "date": "2025/04/11"
  },
  {
    "id": 101,
    "readOnly": true,
    "description": "Had a creative burst and made something I’m really proud of. Felt accomplished.",
    "score": 10,
    "date": "2025/04/16"
  },
  {
    "id": 102,
    "readOnly": true,
    "description": "Spent too much time scrolling on my phone and ended up feeling kind of empty.",
    "score": 3,
    "date": "2025/04/21"
  },
  {
    "id": 103,
    "readOnly": true,
    "description": "Went out for coffee and had a great conversation with someone unexpected.",
    "score": 8,
    "date": "2025/04/26"
  },
  {
    "id": 104,
    "readOnly": true,
    "description": "Felt ignored and disconnected. Nothing I did today seemed to matter.",
    "score": 2,
    "date": "2025/05/01"
  },
  {
    "id": 105,
    "readOnly": true,
    "description": "Tried something new and it went better than I imagined. Felt brave and satisfied.",
    "score": 9,
    "date": "2025/05/05"
  },
  {
    "id": 106,
    "readOnly": true,
    "description": "Had a quiet day with lots of reflection. Didn’t feel good or bad, just neutral.",
    "score": 5,
    "date": "2025/05/08"
  },
  {
    "id": 107,
    "readOnly": true,
    "description": "It was a chill day where I got to think about my life and be grateful. Proud of my story!",
    "score": 7,
    "date": "2025/05/11"
  },
  {
    "id": 108,
    "readOnly": true,
    "description": "Got great feedback on something I’ve been working hard on. Felt seen and appreciated.",
    "score": 10,
    "date": "2025/05/14"
  },
  {
    "id": 109,
    "readOnly": true,
    "description": "Today I coded the whole day and pretty much finished the LifeLine project. It feels great to be proud of your own creation!",
    "score": 10,
    "date": "2025/05/18"
  }
]